pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR32DU32def.inc
; ADC_CTRLF masks
.equ ADC_SAMPNUM_gm = 0x07               ; Sampling Number group mask
.equ ADC_SAMPNUM_gp = 0                  ; Sampling Number group position
.equ ADC_SAMPNUM_0_bm = (1<<0)           ; Sampling Number bit 0 mask
.equ ADC_SAMPNUM_0_bp = 0                ; Sampling Number bit 0 position
.equ ADC_SAMPNUM_1_bm = (1<<1)           ; Sampling Number bit 1 mask
.equ ADC_SAMPNUM_1_bp = 1                ; Sampling Number bit 1 position
.equ ADC_SAMPNUM_2_bm = (1<<2)           ; Sampling Number bit 2 mask
.equ ADC_SAMPNUM_2_bp = 2                ; Sampling Number bit 2 position
.equ ADC_LEFTADJ_bm = 0x10               ; Left Adjust bit mask
.equ ADC_LEFTADJ_bp = 4                  ; Left Adjust bit position
.equ ADC_FREERUN_bm = 0x20               ; Free Running bit mask
.equ ADC_FREERUN_bp = 5                  ; Free Running bit position

; ADC_INTCTRL masks
.equ ADC_RESRDY_bm = 0x01                ; Result Ready Interrupt Enable bit mask
.equ ADC_RESRDY_bp = 0                   ; Result Ready Interrupt Enable bit position
.equ ADC_SAMPRDY_bm = 0x02               ; Sample Ready Interrupt Enable bit mask
.equ ADC_SAMPRDY_bp = 1                  ; Sample Ready Interrupt Enable bit position
.equ ADC_WCMP_bm = 0x04                  ; Window Comparator Interrupt Enable bit mask
.equ ADC_WCMP_bp = 2                     ; Window Comparator Interrupt Enable bit position
.equ ADC_RESOVR_bm = 0x08                ; Result Overwrite Interrupt Enable bit mask
.equ ADC_RESOVR_bp = 3                   ; Result Overwrite Interrupt Enable bit position
.equ ADC_SAMPOVR_bm = 0x10               ; Sample Overwrite Interrupt Enable bit mask
.equ ADC_SAMPOVR_bp = 4                  ; Sample Overwrite Interrupt Enable bit position
.equ ADC_TRIGOVR_bm = 0x20               ; Trigger Overrun Interrupt Enable bit mask
.equ ADC_TRIGOVR_bp = 5                  ; Trigger Overrun Interrupt Enable bit position

; ADC_INTFLAGS masks
; Masks for ADC_RESRDY already defined
; Masks for ADC_SAMPRDY already defined
; Masks for ADC_WCMP already defined
; Masks for ADC_RESOVR already defined
; Masks for ADC_SAMPOVR already defined
; Masks for ADC_TRIGOVR already defined

; ADC_STATUS masks
.equ ADC_ADCBUSY_bm = 0x01               ; ADC Busy bit mask
.equ ADC_ADCBUSY_bp = 0                  ; ADC Busy bit position

; ADC_DBGCTRL masks
.equ ADC_DBGRUN_bm = 0x01                ; Debug run bit mask
.equ ADC_DBGRUN_bp = 0                   ; Debug run bit position

; ADC_COMMAND masks
.equ ADC_START_gm = 0x07                 ; Start Conversion group mask
.equ ADC_START_gp = 0                    ; Start Conversion group position
.equ ADC_START_0_bm = (1<<0)             ; Start Conversion bit 0 mask
.equ ADC_START_0_bp = 0                  ; Start Conversion bit 0 position
.equ ADC_START_1_bm = (1<<1)             ; Start Conversion bit 1 mask
.equ ADC_START_1_bp = 1                  ; Start Conversion bit 1 position
.equ ADC_START_2_bm = (1<<2)             ; Start Conversion bit 2 mask
.equ ADC_START_2_bp = 2                  ; Start Conversion bit 2 position
.equ ADC_MODE_gm = 0x70                  ; Mode group mask
.equ ADC_MODE_gp = 4                     ; Mode group position
.equ ADC_MODE_0_bm = (1<<4)              ; Mode bit 0 mask
.equ ADC_MODE_0_bp = 4                   ; Mode bit 0 position
.equ ADC_MODE_1_bm = (1<<5)              ; Mode bit 1 mask
.equ ADC_MODE_1_bp = 5                   ; Mode bit 1 position
.equ ADC_MODE_2_bm = (1<<6)              ; Mode bit 2 mask
.equ ADC_MODE_2_bp = 6                   ; Mode bit 2 position

; ADC_MUXPOS masks
.equ ADC_MUXPOS_gm = 0x7F                ; Analog Channel Selection Bits group mask
.equ ADC_MUXPOS_gp = 0                   ; Analog Channel Selection Bits group position
.equ ADC_MUXPOS_0_bm = (1<<0)            ; Analog Channel Selection Bits bit 0 mask
.equ ADC_MUXPOS_0_bp = 0                 ; Analog Channel Selection Bits bit 0 position
.equ ADC_MUXPOS_1_bm = (1<<1)            ; Analog Channel Selection Bits bit 1 mask
.equ ADC_MUXPOS_1_bp = 1                 ; Analog Channel Selection Bits bit 1 position
.equ ADC_MUXPOS_2_bm = (1<<2)            ; Analog Channel Selection Bits bit 2 mask
.equ ADC_MUXPOS_2_bp = 2                 ; Analog Channel Selection Bits bit 2 position
.equ ADC_MUXPOS_3_bm = (1<<3)            ; Analog Channel Selection Bits bit 3 mask
.equ ADC_MUXPOS_3_bp = 3                 ; Analog Channel Selection Bits bit 3 position
.equ ADC_MUXPOS_4_bm = (1<<4)            ; Analog Channel Selection Bits bit 4 mask
.equ ADC_MUXPOS_4_bp = 4                 ; Analog Channel Selection Bits bit 4 position
.equ ADC_MUXPOS_5_bm = (1<<5)            ; Analog Channel Selection Bits bit 5 mask
.equ ADC_MUXPOS_5_bp = 5                 ; Analog Channel Selection Bits bit 5 position
.equ ADC_MUXPOS_6_bm = (1<<6)            ; Analog Channel Selection Bits bit 6 mask
.equ ADC_MUXPOS_6_bp = 6                 ; Analog Channel Selection Bits bit 6 position

; ADC_RESULT masks
.equ ADC_RESULT_gm = 0xFFFF              ; ADC Result group mask
.equ ADC_RESULT_gp = 0                   ; ADC Result group position
.equ ADC_RESULT_0_bm = (1<<0)            ; ADC Result bit 0 mask
.equ ADC_RESULT_0_bp = 0                 ; ADC Result bit 0 position
.equ ADC_RESULT_1_bm = (1<<1)            ; ADC Result bit 1 mask
.equ ADC_RESULT_1_bp = 1                 ; ADC Result bit 1 position
.equ ADC_RESULT_2_bm = (1<<2)            ; ADC Result bit 2 mask
.equ ADC_RESULT_2_bp = 2                 ; ADC Result bit 2 position
.equ ADC_RESULT_3_bm = (1<<3)            ; ADC Result bit 3 mask
.equ ADC_RESULT_3_bp = 3                 ; ADC Result bit 3 position
.equ ADC_RESULT_4_bm = (1<<4)            ; ADC Result bit 4 mask
.equ ADC_RESULT_4_bp = 4                 ; ADC Result bit 4 position
.equ ADC_RESULT_5_bm = (1<<5)            ; ADC Result bit 5 mask
.equ ADC_RESULT_5_bp = 5                 ; ADC Result bit 5 position
.equ ADC_RESULT_6_bm = (1<<6)            ; ADC Result bit 6 mask
.equ ADC_RESULT_6_bp = 6                 ; ADC Result bit 6 position
.equ ADC_RESULT_7_bm = (1<<7)            ; ADC Result bit 7 mask
.equ ADC_RESULT_7_bp = 7                 ; ADC Result bit 7 position
.equ ADC_RESULT_8_bm = (1<<8)            ; ADC Result bit 8 mask
.equ ADC_RESULT_8_bp = 8                 ; ADC Result bit 8 position
.equ ADC_RESULT_9_bm = (1<<9)            ; ADC Result bit 9 mask
.equ ADC_RESULT_9_bp = 9                 ; ADC Result bit 9 position
.equ ADC_RESULT_10_bm = (1<<10)          ; ADC Result bit 10 mask
.equ ADC_RESULT_10_bp = 10               ; ADC Result bit 10 position
.equ ADC_RESULT_11_bm = (1<<11)          ; ADC Result bit 11 mask
.equ ADC_RESULT_11_bp = 11               ; ADC Result bit 11 position
.equ ADC_RESULT_12_bm = (1<<12)          ; ADC Result bit 12 mask
.equ ADC_RESULT_12_bp = 12               ; ADC Result bit 12 position
.equ ADC_RESULT_13_bm = (1<<13)          ; ADC Result bit 13 mask
.equ ADC_RESULT_13_bp = 13               ; ADC Result bit 13 position
.equ ADC_RESULT_14_bm = (1<<14)          ; ADC Result bit 14 mask
.equ ADC_RESULT_14_bp = 14               ; ADC Result bit 14 position
.equ ADC_RESULT_15_bm = (1<<15)          ; ADC Result bit 15 mask
.equ ADC_RESULT_15_bp = 15               ; ADC Result bit 15 position

